clear
close all

% 前端采样点
initroutewithtime = importdata("initroutewithtime.txt");
% 前端传到后端的点
originroute = importdata("originroute.txt");

% 获得M矩阵
piece_num = size(originroute, 1);
M = zeros(8*piece_num,8*piece_num);
b = zeros(8*piece_num,1);
M(1:4,1:8) = [1 0 0 0 0 0 0 0; 0 1 0 0 0 0 0 0 ;0 0 2 0 0 0 0 0 ;0 0 0 6 0 0 0 0];
b(1:4,:) = [originroute(0,0);0;0;0];
M_part = [1,t,t^2,t^3,t^4,t^5,t^6,t^7;
          1,t,t^2,t^3,t^4,t^5,t^6,t^7;
          0,1,2*t,3*t^2,4*t^3,5*t^4,6*t^5,7*t^6;
          0,0,2,6*t,12*t^2,20*t^3,30*t^4,42*t^5;
          0,0,0,6,24*t,60*t^2,120*t^3,210*t^4;
          0,0,0,0,24,120*t,360*t^2,840*t^3;
          0,0,0,0,0,120,720*t,2520*t^2;
          0,0,0,0,0,0,720,5040*t];
for i=1:piece_num-1
    % E
    M(5+8*(i-1):12+8*(i-1),1+8*(i-1):8+8*(i-1)) = M_part;
    % F
    M(5+8*(i-1):12+8*(i-1),9+8*(i-1):16+8*(i-1)) = [0,0,0,0,0,0,0,0;
                                                  -1,0,0,0,0,0,0,0;
                                                  0,-1,0,0,0,0,0,0;
                                                  0,0,-2,0,0,0,0,0;
                                                  0,0,0,-6,0,0,0,0;
                                                  0,0,0,0,-24,0,0,0;
                                                  0,0,0,0,0,-120,0,0;
                                                  0,0,0,0,0,0,-720,0];
    b(5+8*(i-1):12+8*(i-1),:) = [q(i,:);0,0;0,0;0,0;0,0;0,0;0,0;0,0];
end
M(end-3:end,end-7:end) = [M_part(2,:);M_part(3,:);M_part(4,:);M_part(5,:)];
b(end-3:end,:) = [originroute(end,0);0;0;0];


